Revit 2023 API
SiteSubRegion Members
The SiteSubRegion type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>)
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList<CurveLoop>, ElementId)
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Dispose
Releases all resources used by the SiteSubRegion
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundary
 Gets the boundary of current subregion.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidBoundary
 Identifies whether the given curve loops compose a valid boundary.
SetBoundary
 Set the given curve loops as the boundary of an existing SiteSubRegion.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
HostId
 The element id of the topography surface hosting this SiteSubRegion.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TopographySurface
 The TopographySurface element which this SiteSubRegion represents.
See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace